app/controllers/chat_controller.rb

SELECT `chatmessages`.* FROM `chatmessages` ORDER BY `chatmessages`.`id` DESC, `chatmessages`.`created_at` DESC LIMIT 10
---
  def index
    @messages = Chatmessage.order(:id => :desc).limit(10)

INSERT INTO `chatmessages` (`author`, `created_at`, `message`, `updated_at`) VALUES ('Adrian', '2017-10-26 19:37:57', 'undefined', '2017-10-26 19:37:57')
---
  def save_chat_message
    Chatmessage.save_chat_message(params)