app/controllers/chatadmin_controller.rb

SELECT `chatmessages`.* FROM `chatmessages` ORDER BY id desc
---
  def all
    @page = params[:page]
    @chatmessages = Chatmessage.all.order('id desc')