app/controllers/newsadmin_controller.rb

SELECT `newsarticles`.* FROM `newsarticles` ORDER BY id desc
SELECT COUNT(*) FROM `newsarticles`
---
  def all
    @page = params[:page]
    @newsarticles = Newsarticle.all.order('id desc')
    @count = @newsarticles.count

INSERT INTO `newsarticles` (`author_id`, `body_raw`, `created_at`, `published_first_at`, `status`, `title`, `title_modified`, `updated_at`) VALUES (1, 'Body 1 2 3', '2017-10-26 17:46:07', '2017-10-26 17:46:07', 'Active', 'Title 1 2 3 ', 'Title-1-2-3', '2017-10-26 17:46:07')
---
  def save_story
    Newsarticle.save_story(params)

SELECT `newsarticles`.* FROM `newsarticles` WHERE `newsarticles`.`id` IS NULL LIMIT 1
---
  def edit_story
    @id = params[:story_id]
    @story = Newsarticle.find_by_id(@id)

UPDATE `newsarticles` SET `body_raw` = '8889', `updated_at` = '2017-10-25 23:08:14' WHERE `newsarticles`.`id` = 406
---
  def update_story
    Newsarticle.update_story(params)

SELECT `newsarticles`.* FROM `newsarticles` WHERE `newsarticles`.`id` = 406 LIMIT 1
DELETE FROM `newsarticles` WHERE `newsarticles`.`id` = 406
---
  def delete_story
    @story_id = params[:story_id]
    @story = Newsarticle.find_by_id(@story_id)
    if @story != nil then
      flash[:success] = "Story deleted."
      @story.destroy