app/controllers/news_controller.rb

  def story
    @id = params[:id]
    @story = Newsarticle.find_by_id(@id)
---
SELECT `newsarticles`.* FROM `newsarticles` WHERE `newsarticles`.`id` = 401 LIMIT 1